RWDItestOF7Dir/RWDItestOF7/motorBike/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0        0        0)
    (5.534081 0        0)
    (5.534081 6.295518 0)
    (0        6.295518 0)
    (0        0        0.984488)
    (5.534081 0        0.984488)
    (5.534081 6.295518 0.984488)
    (0        6.295518 0.984488)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (74 84 13) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
